espressif/esp-idf/components/soc/esp32h2/include/soc/rtc_cntl_reg.h
#define RTC_CNTL_RTCULATOR1_DBIAS_REG          (DR_REG_RTCCNTL_BASE + 0x0088)
/* RTC_CNTL_REGULATOR1_DBIAS_ACTIVE : R/W ;bitpos:[28:25] ;default: 4'b1000 ; */
/*description: the rtc regulator1 dbias when chip in active state*/
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE  0x0000000F
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_M  ((RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_V)<<(RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_S))
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_V  0xF
#define RTC_CNTL_REGULATOR1_DBIAS_ACTIVE_S  25
/* RTC_CNTL_REGULATOR1_DBIAS_SLP : R/W ;bitpos:[23:20] ;default: 4'b1000 ; */
/*description: the rtc regulator1 dbias when chip in sleep state*/
#define RTC_CNTL_REGULATOR1_DBIAS_SLP  0x0000000F
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_M  ((RTC_CNTL_REGULATOR1_DBIAS_SLP_V)<<(RTC_CNTL_REGULATOR1_DBIAS_SLP_S))
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_V  0xF
#define RTC_CNTL_REGULATOR1_DBIAS_SLP_S  20

#define RTC_CNTL_DIGULATOR_REG          (DR_REG_RTCCNTL_BASE + 0x008C)
/* RTC_CNTL_DG_REGULATOR_FORCE_PU : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: */
#define RTC_CNTL_DG_REGULATOR_FORCE_PU  (BIT(31))
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_M  (BIT(31))
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_V  0x1
#define RTC_CNTL_DG_REGULATOR_FORCE_PU_S  31
/* RTC_CNTL_DG_REGULATOR_FORCE_PD : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_DG_REGULATOR_FORCE_PD  (BIT(30))
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_M  (BIT(30))
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_V  0x1
#define RTC_CNTL_DG_REGULATOR_FORCE_PD_S  30
/* RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU : R/W ;bitpos:[29] ;default: 1'b1 ; */
/*description: */
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU  (BIT(29))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_M  (BIT(29))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_V  0x1
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PU_S  29
/* RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD  (BIT(28))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_M  (BIT(28))
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_V  0x1
#define RTC_CNTL_DG_REGULATOR_SLP_FORCE_PD_S  28
/* RTC_CNTL_DG_VDD_DRV_B_SLP_EN : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN  (BIT(27))
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_M  (BIT(27))
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_V  0x1
#define RTC_CNTL_DG_VDD_DRV_B_SLP_EN_S  27
/* RTC_CNTL_DG_VDD_DRV_B_SLP : R/W ;bitpos:[26:3] ;default: 24'd0 ; */
/*description: */
#define RTC_CNTL_DG_VDD_DRV_B_SLP  0x00FFFFFF
#define RTC_CNTL_DG_VDD_DRV_B_SLP_M  ((RTC_CNTL_DG_VDD_DRV_B_SLP_V)<<(RTC_CNTL_DG_VDD_DRV_B_SLP_S))
#define RTC_CNTL_DG_VDD_DRV_B_SLP_V  0xFFFFFF
#define RTC_CNTL_DG_VDD_DRV_B_SLP_S  3

#define RTC_CNTL_DIGULATOR_DRVB_REG          (DR_REG_RTCCNTL_BASE + 0x0090)
/* RTC_CNTL_DG_VDD_DRV_B_ACTIVE : R/W ;bitpos:[23:0] ;default: 24'd0 ; */
/*description: */
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE  0x00FFFFFF
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_M  ((RTC_CNTL_DG_VDD_DRV_B_ACTIVE_V)<<(RTC_CNTL_DG_VDD_DRV_B_ACTIVE_S))
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_V  0xFFFFFF
#define RTC_CNTL_DG_VDD_DRV_B_ACTIVE_S  0

#define RTC_CNTL_DIGULATOR0_DBIAS_REG          (DR_REG_RTCCNTL_BASE + 0x0094)
/* RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: 1: select sw dbias_active 0: select pvt value*/
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL  (BIT(31))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_M  (BIT(31))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_V  0x1
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SEL_S  31
/* RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT : WO ;bitpos:[30] ;default: 1'b0 ; */
/*description: initial pvt dbias value*/
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT  (BIT(30))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_M  (BIT(30))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_V  0x1
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_INIT_S  30
/* RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE : R/W ;bitpos:[29:25] ;default: 5'b10100 ; */
/*description: the dig regulator0 dbias when chip in active state*/
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE  0x0000001F
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_M  ((RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_V)<<(RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_S))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_V  0x1F
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_ACTIVE_S  25
/* RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP : R/W ;bitpos:[24:20] ;default: 5'b10100 ; */
/*description: the dig regulator0 dbias when chip in sleep state*/
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP  0x0000001F
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_M  ((RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_V)<<(RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_S))
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_V  0x1F
#define RTC_CNTL_DIG_REGULATOR0_DBIAS_SLP_S  20
/* RTC_CNTL_PVT_DIG_DBIAS : RO ;bitpos:[19:15] ;default: 5'b10100 ; */
/*description: get pvt dbias value*/
#define RTC_CNTL_PVT_DIG_DBIAS  0x0000001F
#define RTC_CNTL_PVT_DIG_DBIAS_M  ((RTC_CNTL_PVT_DIG_DBIAS_V)<<(RTC_CNTL_PVT_DIG_DBIAS_S))
#define RTC_CNTL_PVT_DIG_DBIAS_V  0x1F
#define RTC_CNTL_PVT_DIG_DBIAS_S  15

#define RTC_CNTL_DIGULATOR1_DBIAS_REG          (DR_REG_RTCCNTL_BASE + 0x0098)
/* RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE : R/W ;bitpos:[28:25] ;default: 4'b1000 ; */
/*description: the dig regulator1 dbias when chip in active state*/
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE  0x0000000F
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_M  ((RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_V)<<(RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_S))
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_V  0xF
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_ACTIVE_S  25
/* RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP : R/W ;bitpos:[23:20] ;default: 4'b1000 ; */
/*description: the dig regulator1 dbias when chip in sleep state*/
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP  0x0000000F
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_M  ((RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_V)<<(RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_S))
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_V  0xF
#define RTC_CNTL_DIG_REGULATOR1_DBIAS_SLP_S  20

#define RTC_CNTL_PWC_REG          (DR_REG_RTCCNTL_BASE + 0x009C)
/* RTC_CNTL_PAD_FORCE_HOLD : R/W ;bitpos:[21] ;default: 1'd0 ; */
/*description: rtc pad force hold*/
#define RTC_CNTL_PAD_FORCE_HOLD  (BIT(21))
#define RTC_CNTL_PAD_FORCE_HOLD_M  (BIT(21))
#define RTC_CNTL_PAD_FORCE_HOLD_V  0x1
#define RTC_CNTL_PAD_FORCE_HOLD_S  21

