espressif/esp-idf/components/soc/esp32h2/include/soc/rtc_cntl_reg.h
#define RTC_CNTL_RC32K_CTRL_REG          (DR_REG_RTCCNTL_BASE + 0x015C)
/* RTC_CNTL_RC32K_XPD : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_RC32K_XPD  (BIT(31))
#define RTC_CNTL_RC32K_XPD_M  (BIT(31))
#define RTC_CNTL_RC32K_XPD_V  0x1
#define RTC_CNTL_RC32K_XPD_S  31
/* RTC_CNTL_RC32K_DFREQ : R/W ;bitpos:[30:21] ;default: 10'h1ff ; */
/*description: */
#define RTC_CNTL_RC32K_DFREQ  0x000003FF
#define RTC_CNTL_RC32K_DFREQ_M  ((RTC_CNTL_RC32K_DFREQ_V)<<(RTC_CNTL_RC32K_DFREQ_S))
#define RTC_CNTL_RC32K_DFREQ_V  0x3FF
#define RTC_CNTL_RC32K_DFREQ_S  21

#define RTC_CNTL_PLL8M_REG          (DR_REG_RTCCNTL_BASE + 0x0160)
/* RTC_CNTL_XPD_PLL8M : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_XPD_PLL8M  (BIT(31))
#define RTC_CNTL_XPD_PLL8M_M  (BIT(31))
#define RTC_CNTL_XPD_PLL8M_V  0x1
#define RTC_CNTL_XPD_PLL8M_S  31
/* RTC_CNTL_CKREF_PLL8M_SEL : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define RTC_CNTL_CKREF_PLL8M_SEL  (BIT(30))
#define RTC_CNTL_CKREF_PLL8M_SEL_M  (BIT(30))
#define RTC_CNTL_CKREF_PLL8M_SEL_V  0x1
#define RTC_CNTL_CKREF_PLL8M_SEL_S  30

#define RTC_CNTL_DATE_REG          (DR_REG_RTCCNTL_BASE + 0x01fc)
/* RTC_CNTL_CNTL_DATE : R/W ;bitpos:[27:0] ;default: 28'h2103250 ; */
/*description: */
#define RTC_CNTL_CNTL_DATE  0x0FFFFFFF
#define RTC_CNTL_CNTL_DATE_M  ((RTC_CNTL_CNTL_DATE_V)<<(RTC_CNTL_CNTL_DATE_S))
#define RTC_CNTL_CNTL_DATE_V  0xFFFFFFF
#define RTC_CNTL_CNTL_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_RTC_CNTL_REG_H_ */


